# 根据香肠模板设置裁剪图片roi自动裁剪对应图片
import os
import cv2 as cv
# #13:02
# img_roi_list = [
#     [0, 900, 0, 500],
#     [0, 900, 450, 990],
#     [0, 900, 930, 1370],
#     [0, 900, 1400, 1940],
#     [0, 900, 1870, 2410],
#     [0, 900, 2330, 2800],
#
#     [900, 1800, 0, 500],
#     [900, 1800, 430, 990],
#     [900, 1800, 910, 1370],
#     [900, 1800, 1380, 1940],
#     [900, 1800, 1870, 2410],
#     [900, 1800, 2330, 2800],
#
#     [1800, 2700, 0, 500],
#     [1800, 2700, 430, 990],
#     [1800, 2700, 910, 1370],
#     [1800, 2700, 1380, 1940],
#     [1800, 2700, 1870, 2410],
#     [1800, 2700, 2330, 2800],
# ]

# # 6*3玉米肠版面 2800*2700 切刀后移导致相机后移 2
img_roi_list = [
    [0, 830, 0, 480],
    [0, 830, 420, 960],
    [0, 830, 900, 1440],
    [0, 830, 1380, 1920],
    [0, 850, 1850, 2390],
    [0, 850, 2310, 2800],

    [820, 1700, 0, 480],
    [820, 1700, 420, 960],
    [820, 1700, 900, 1440],
    [820, 1700, 1380, 1920],
    [840, 1720, 1850, 2390],
    [860, 1720, 2310, 2800],

    [1680, 2580, 0, 480],
    [1680, 2580, 420, 960],
    [1680, 2580, 900, 1440],
    [1700, 2600, 1380, 1920],
    [1700, 2600, 1850, 2390],
    [1700, 2600, 2310, 2800],
]
names = 1
file_list = os.listdir("./16")
file_path = "./16/"
for i in file_list:
    # 获取文件名中ng原因
    ng_name = i.split("-")[-3]
    print(ng_name)
    # 获取文件名中ng香肠编号
    location_name = int(i.split("-")[-2])-1
    # if ng_name == "1":
    img = cv.imread(file_path+i)
    im = img[img_roi_list[location_name][0]:img_roi_list[location_name][1], img_roi_list[location_name][2]:img_roi_list[location_name][3]]
    file_name = "./1/"+"6x3_yiwu_16_"+str(names)+"_"+ng_name+".png"
    cv.imwrite(file_name, im)
    names += 1
    # for ii in range(len(img_roi_list)):
    #     im = img[img_roi_list[ii][0]:img_roi_list[ii][1], img_roi_list[ii][2]:img_roi_list[ii][3]]
    #     print()
    #     file_name = "./sh1/"+"6x3_yiwu_1_"+str(names) + ".png"
    #     cv.imwrite(file_name, im)
    #